app/controllers/posts_controller.rb

  def create
    # @post.user = current_user
      if @post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "I can't eat tree nuts -- they'll kill me."], ["user_id", 1], ["created_at", "2015-05-13 22:35:17.562961"], ["updated_at", "2015-05-13 22:35:17.562961"]]