app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Tammy"], ["user_id", 1], ["created_at", "2015-05-14 21:25:20.820004"], ["updated_at", "2015-05-14 21:25:20.820004"]]
---
  def create
    @profile.user = current_user
      if @profile.save

UPDATE "profiles" SET "name" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["name", "Bob"], ["updated_at", "2015-05-14 21:32:49.895419"], ["id", 5]]
---
  def update
      if @profile.update(profile_params)